Repository: amrkora/kalory-help-web
Catalog: lib/l10n/app_*.arb
Languages: ar

# navHome
source: Home
ar: الرئيسية

# navLog
source: Log
ar: السجل

# navDiscover
source: Discover
ar: اكتشف

# navProgress
source: Progress
ar: متابعة

# navProfile
source: Profile
ar: الملف الشخصي

# discoverTitle
source: Discover
ar: اكتشف

# recipesToExplore
source: {count} recipes to explore
ar: {count} وصفة للاستكشاف

source: Search recipes...
ar: ابحث عن وصفات...

source: FEATURED
ar: مميز

source: All Recipes
ar: جميع الوصفات

# recipesCount
source: {count} recipes
ar: {count} وصفة

source: No recipes found
ar: لم يتم العثور على وصفات

source: Nutrition per serving
ar: القيمة الغذائية لكل حصة

source: Method
ar: طريقة التحضير

source: View on {source}
ar: عرض على {source}

source: Clear search
ar: مسح البحث

source: Today's Log
ar: سجل اليوم

source: Search foods to add...
ar: ابحث عن أطعمة لإضافتها...

source: Quick Add
ar: إضافة سريعة

source: Today's Meals
ar: وجبات اليوم

# noMealsLogged
source: No meals logged yet today
ar: لم يتم تسجيل وجبات اليوم

# tapAddFood
source: Tap "Add Food" or use Quick Add above
ar: اضغط "إضافة طعام" أو استخدم الإضافة السريعة

source: Add Food
ar: إضافة طعام

source: Add item
ar: إضافة عنصر

source: Delete meal
ar: حذف الوجبة

# deleteMealTitle
source: Delete Meal
ar: حذف الوجبة

# deleteMealConfirm
source: Remove {mealType} and all its food items?
ar: هل تريد إزالة {mealType} وجميع عناصرها؟

source: Daily Summary
ar: الملخص اليومي

source: Consumed
ar: المستهلك

source: Remaining
ar: المتبقي

source: Goal
ar: الهدف

source: Serving size
ar: حجم الحصة

source: Custom amount
ar: كمية مخصصة

# addTo
source: Add to {mealType}
ar: إضافة إلى {mealType}

source: Meal options
ar: خيارات الوجبة

source: My Profile
ar: الملف الشخصي

source: Daily Goals
ar: الأهداف اليومية

source: Recalculate
ar: إعادة الحساب

source: Recalculate Goals
ar: إعادة حساب الأهداف

# recalculateMessage
source: This will recalculate all your daily nutrition goals based on your current body info (gender, height, weight, age, activity level). Any manual edits to individual goals will be overwritten.
ar: سيتم إعادة حساب جميع أهدافك الغذائية اليومية بناءً على معلومات جسمك الحالية (الجنس، الطول، الوزن، العمر، مستوى النشاط). سيتم استبدال أي تعديلات يدوية على الأهداف الفردية.

source: Body Info
ar: معلومات الجسم

source: Preferences
ar: التفضيلات

source: Account
ar: الحساب

source: Dark Mode
ar: الوضع الداكن

source: Language
ar: اللغة

source: Choose Language
ar: اختر اللغة

source: Export Data
ar: تصدير البيانات

source: Privacy Policy
ar: سياسة الخصوصية

source: Help & Support
ar: المساعدة والدعم

source: Data exported!
ar: تم تصدير البيانات!

# exportFailed
source: Export failed. Please try again.
ar: فشل التصدير. يرجى المحاولة مرة أخرى.

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Height
ar: الطول

source: Weight
ar: الوزن

source: Age
ar: العمر

source: Activity Level
ar: مستوى النشاط

source: Diet Type
ar: نوع النظام الغذائي

source: Sedentary
ar: خامل

# sedentaryDesc
source: Little to no exercise
ar: قليل أو بدون تمارين

source: Light
ar: خفيف

# lightDesc
source: Light exercise 1-3 days/week
ar: تمارين خفيفة ١-٣ أيام/أسبوع

source: Moderate
ar: معتدل

# moderateDesc
source: Moderate exercise 3-5 days/week
ar: تمارين معتدلة ٣-٥ أيام/أسبوع

source: Active
ar: نشيط

# activeDesc
source: Hard exercise 6-7 days/week
ar: تمارين شاقة ٦-٧ أيام/أسبوع

source: Very Active
ar: نشيط جداً

# veryActiveDesc
source: Very hard exercise & physical job
ar: تمارين شاقة جداً ووظيفة بدنية

# omnivore
source: Flexible
ar: مرن

# omnivoreDesc
source: No dietary restrictions
ar: بدون قيود غذائية

source: Vegetarian
ar: نباتي

# vegetarianDesc
source: No meat or fish
ar: بدون لحوم أو أسماك

source: Vegan
ar: نباتي صرف

# veganDesc
source: No animal products at all
ar: بدون منتجات حيوانية

source: Pescatarian
ar: نباتي يأكل السمك

# pescatarianDesc
source: Fish & seafood, no meat
ar: أسماك ومأكولات بحرية، بدون لحوم

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Add
ar: إضافة

source: Edit
ar: تعديل

source: Back
ar: رجوع

source: Next
ar: التالي

source: Close
ar: إغلاق

source: Not set
ar: غير محدد

source: Calories
ar: السعرات

source: Protein
ar: البروتين

source: Carbs
ar: الكربوهيدرات

source: Fat
ar: الدهون

source: Fiber
ar: الألياف

source: Water
ar: الماء

# welcomeTitle
source: Welcome to Kalory Help
ar: مرحباً بك في مساعدة كالوري

# welcomeSubtitle
source: Let's personalize your nutrition goals based on your body and lifestyle.
ar: لنخصص أهدافك الغذائية بناءً على جسمك ونمط حياتك.

source: Get Started
ar: ابدأ الآن

# biologicalSex
source: What's your biological sex?
ar: ما هو جنسك البيولوجي؟

# biologicalSexSubtitle
source: This helps us calculate your basal metabolic rate.
ar: يساعدنا هذا في حساب معدل الأيض الأساسي.

source: Your measurements
ar: قياساتك

# measurementsSubtitle
source: We use these to estimate your daily energy needs.
ar: نستخدمها لتقدير احتياجاتك اليومية من الطاقة.

# ageRangeQuestion
source: What's your age range?
ar: ما هو نطاق عمرك؟

# ageRangeSubtitle
source: Age affects your metabolic rate.
ar: العمر يؤثر على معدل الأيض.

# activityQuestion
source: How active are you?
ar: ما مدى نشاطك؟

# activitySubtitle
source: This determines your daily calorie multiplier.
ar: يحدد هذا مضاعف السعرات الحرارية اليومية.

# dietTypeQuestion
source: What's your diet type?
ar: ما هو نوع نظامك الغذائي؟

# dietTypeSubtitle
source: This helps tailor your macro ratios. You can skip this.
ar: يساعد في تخصيص نسب المغذيات الكبرى. يمكنك التخطي.

source: Your Daily Goals
ar: أهدافك اليومية

# goalsRecommendation
source: Based on your profile, here's what we recommend.
ar: بناءً على ملفك الشخصي، إليك ما نوصي به.

source: Let's Go!
ar: هيا بنا!

source: Go Back
ar: رجوع

source: Food name
ar: اسم الطعام

source: Meal
ar: الوجبة

# noFoodsFound
source: No foods found for "{query}"
ar: لم يتم العثور على أطعمة لـ "{query}"

# resultCount
source: {count, plural, =0{No results} =1{1 result} other{{count} results}}
ar: {count, plural, zero{لا نتائج} one{نتيجة واحدة} two{نتيجتان} few{{count} نتائج} many{{count} نتيجة} other{{count} نتيجة}}

# addedToMeal
source: {food} added to {mealType}
ar: تمت إضافة {food} إلى {mealType}

# removed
source: {item} removed
ar: تمت إزالة {item}

# deleted
source: {item} deleted
ar: تم حذف {item}

# addedText
source: {item} added
ar: تمت إضافة {item}

# failedToAdd
source: Failed to add: {error}
ar: فشل في الإضافة: {error}

# failedToDelete
source: Failed to delete: {error}
ar: فشل في الحذف: {error}

# failedToRemove
source: Failed to remove: {error}
ar: فشل في الإزالة: {error}

source: Breakfast
ar: فطور

source: Lunch
ar: غداء

source: Dinner
ar: عشاء

source: Snack
ar: وجبة خفيفة

source: Dessert
ar: حلوى

source: All
ar: الكل

# appVersion
source: Kalory Help v2.0.0
ar: مساعدة كالوري الإصدار 1.0.0

source: Good morning
ar: صباح الخير

source: Good afternoon
ar: مساء الخير

source: Good evening
ar: مساء الخير

source: Kalory Help
ar: كالوري

source: Toggle theme
ar: تبديل المظهر

source: Tip of the Day
ar: نصيحة اليوم

# progressTitle
source: Progress
ar: متابعة

source: Week
ar: أسبوع

source: Month
ar: شهر

# threeMonths
source: 3 Months
ar: ٣ أشهر

source: Weight Trend
ar: اتجاه الوزن

source: No weight data
ar: لا توجد بيانات وزن

# weightChartLabel
source: Weight trend chart showing {count} data points
ar: رسم بياني لاتجاه الوزن يعرض {count} نقطة بيانات

source: Current
ar: الحالي

source: Change
ar: التغيير

source: BMI
ar: مؤشر كتلة الجسم

source: Underweight
ar: نحيف

source: Normal
ar: طبيعي

source: Overweight
ar: زائد الوزن

source: Obese
ar: سمين

source: N/A
ar: غ/م

source: Calorie Trends
ar: اتجاهات السعرات

source: No calorie data
ar: لا توجد بيانات سعرات

source: Nutrition Averages
ar: متوسطات التغذية

source: Daily average this week
ar: المتوسط اليومي هذا الأسبوع

source: STREAKS & ACHIEVEMENTS
ar: السلاسل والإنجازات

source: Logging Streak
ar: سلسلة التسجيل

source: Water Streak
ar: سلسلة الماء

source: Weekly Goals Met
ar: الأهداف الأسبوعية المحققة

# daysCount
source: {count} days
ar: {count} يوم

# countOfFour
source: {count} of 4
ar: {count} من 4

# faq
source: Frequently Asked Questions
ar: الأسئلة الشائعة

# faqDataStoredQ
source: How is my data stored?
ar: كيف يتم تخزين بياناتي؟

# faqDataStoredA
source: All your data is stored locally on your device using Hive, a lightweight local database. Nothing is ever sent to a server. Your nutrition data never leaves your device.
ar: يتم تخزين جميع بياناتك محلياً على جهازك باستخدام Hive، قاعدة بيانات محلية خفيفة. لا يتم إرسال أي شيء إلى خادم. بيانات التغذية الخاصة بك لا تغادر جهازك أبداً.

# faqExportQ
source: Can I export my data?
ar: هل يمكنني تصدير بياناتي؟

# faqExportA
source: Yes! Go to Profile > Export Data to download a JSON file containing all your meals, water intake, weight entries, and profile information.
ar: نعم! اذهب إلى الملف الشخصي > تصدير البيانات لتنزيل ملف JSON يحتوي على جميع وجباتك واستهلاك الماء وإدخالات الوزن ومعلومات الملف الشخصي.

# faqResetQ
source: How do I reset my data?
ar: كيف أعيد تعيين بياناتي؟

# faqResetA
source: You can clear all your data using the "Delete All Data" option in Profile > Settings, or by uninstalling and reinstalling the app.
ar: يمكنك مسح جميع بياناتك باستخدام خيار "حذف جميع البيانات" في الملف الشخصي > الإعدادات، أو عن طريق إلغاء تثبيت التطبيق وإعادة تثبيته.

# faqSyncQ
source: Is my data synced anywhere?
ar: هل تتم مزامنة بياناتي في أي مكان؟

# faqSyncA
source: No. Kalory Help is fully offline. There are no accounts, no cloud sync, and no remote databases. Your data exists only on this device.
ar: لا. مساعدة كالوري يعمل بالكامل بدون اتصال. لا توجد حسابات ولا مزامنة سحابية ولا قواعد بيانات عن بُعد. بياناتك موجودة فقط على هذا الجهاز.

source: About Kalory Help
ar: حول مساعدة كالوري

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

# aboutDescription
source: Kalory Help is a privacy-first nutrition tracking app that works entirely on your device. Track meals, water intake, and weight — all without an account or internet connection. Disclaimer: This app is for informational purposes only and is not a substitute for professional medical or nutritional advice.
ar: مساعدة كالوري هو تطبيق تتبع تغذية يركز على الخصوصية ويعمل بالكامل على جهازك. تتبع الوجبات واستهلاك الماء والوزن — كل ذلك بدون حساب أو اتصال بالإنترنت. إخلاء مسؤولية: هذا التطبيق لأغراض إعلامية فقط وليس بديلاً عن الاستشارة الطبية أو الغذائية المتخصصة.

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية

# lastUpdated
source: Last updated: February 2026
ar: آخر تحديث: فبراير 2026

# privacyDataStaysTitle
source: Your Data Stays on Your Device
ar: بياناتك تبقى على جهازك

# privacyDataStaysBody
source: Kalory Help is a fully offline nutrition tracking app. All data you enter — including meals, water intake, weight, and profile information — is stored exclusively on your device. Nothing is sent to any server.
ar: مساعدة كالوري هو تطبيق تتبع تغذية يعمل بالكامل بدون اتصال. جميع البيانات التي تدخلها — بما في ذلك الوجبات واستهلاك الماء والوزن ومعلومات الملف الشخصي — يتم تخزينها حصرياً على جهازك. لا يتم إرسال أي شيء إلى أي خادم.

# privacyNoCollectionTitle
source: No Data Collection
ar: لا جمع للبيانات

# privacyNoCollectionBody
source: We do not collect, transmit, or store any personal information. There are no user accounts, no cloud sync, and no remote databases.
ar: نحن لا نجمع أو ننقل أو نخزن أي معلومات شخصية. لا توجد حسابات مستخدمين ولا مزامنة سحابية ولا قواعد بيانات عن بُعد.

# privacyNoAnalyticsTitle
source: No Analytics or Tracking
ar: لا تحليلات أو تتبع

# privacyNoAnalyticsBody
source: Kalory Help does not use any analytics services, advertising SDKs, or tracking technologies. We do not track your usage patterns, location, or any other behavioral data.
ar: مساعدة كالوري لا يستخدم أي خدمات تحليلات أو حزم SDK إعلانية أو تقنيات تتبع. نحن لا نتتبع أنماط استخدامك أو موقعك أو أي بيانات سلوكية أخرى.

# privacyNoSharingTitle
source: No Third-Party Sharing
ar: لا مشاركة مع أطراف ثالثة

# privacyNoSharingBody
source: Since no data leaves your device, there is nothing to share with third parties. Your nutrition data is yours alone.
ar: بما أنه لا تغادر أي بيانات جهازك، فلا يوجد شيء لمشاركته مع أطراف ثالثة. بيانات التغذية الخاصة بك هي ملكك وحدك.

# privacyDeletionTitle
source: Data Deletion
ar: حذف البيانات

# privacyDeletionBody
source: You can delete all your data at any time using the "Delete All Data" option in Profile > Settings, or by uninstalling the app. Once deleted, data cannot be recovered — because we never had a copy.
ar: يمكنك حذف جميع بياناتك في أي وقت باستخدام خيار "حذف جميع البيانات" في الملف الشخصي > الإعدادات، أو عن طريق إلغاء تثبيت التطبيق. بمجرد الحذف، لا يمكن استرداد البيانات — لأننا لم نحتفظ بنسخة منها أبداً.

# privacyContactTitle
source: Contact
ar: التواصل

# privacyContactBody
source: If you have any questions about this privacy policy, please contact us at contact@kalory.help.
ar: إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى التواصل عبر صفحة التطبيق في المتجر.

source: Day Flow
ar: تدفق اليوم

# mealsCount
source: {count, plural, =0{No meals} =1{1 meal} other{{count} meals}}
ar: {count, plural, zero{لا وجبات} one{وجبة واحدة} two{وجبتان} few{{count} وجبات} many{{count} وجبة} other{{count} وجبة}}

source: No meals logged yet
ar: لم يتم تسجيل وجبات بعد

source: Hydration
ar: الترطيب

# tapToAddGlass
source: Tap to add a glass
ar: اضغط لإضافة كوب

source: Water intake
ar: استهلاك الماء

# glassesToday
source: {current} / {goal} glasses today
ar: {current} / {goal} أكواب اليوم

# remainingLabel
source: remaining
ar: متبقي

# overLabel
source: over
ar: زائد

source: Kalory Score
ar: نقاط مساعدة كالوري

source: Score Breakdown
ar: تفاصيل النقاط

source: Calorie Adherence
ar: الالتزام بالسعرات

source: Macro Balance
ar: توازن العناصر الغذائية

source: Perfect day!
ar: يوم مثالي!

source: Great balance!
ar: توازن رائع!

source: Getting there
ar: في الطريق الصحيح

source: Needs attention
ar: يحتاج انتباه

# foodBanana
source: Banana
ar: موز

# foodChickenBreast
source: Chicken Breast
ar: صدر دجاج

# foodRice
source: Rice
ar: أرز

# foodEggs
source: Eggs
ar: بيض

# foodOatmeal
source: Oatmeal
ar: شوفان

# foodApple
source: Apple
ar: تفاحة

# foodYogurt
source: Yogurt
ar: زبادي

# proteinGrams
source: {value}g protein
ar: {value}جم بروتين

# kcalPer100g
source: {kcal} kcal / 100g
ar: {kcal} سعرة حرارية / 100جم

# kcalPerServing
source: {kcal} kcal / serving
ar: {kcal} سعرة حرارية / حصة

# foodOatmealWithBerries
source: Oatmeal with Berries
ar: شوفان بالتوت

# foodGreekYogurt
source: Greek Yogurt
ar: زبادي يوناني

# foodBlackCoffee
source: Black Coffee
ar: قهوة سوداء

# foodAlmonds10
source: Almonds (10)
ar: لوز (10)

# foodGrilledChickenSalad
source: Grilled Chicken Salad
ar: سلطة دجاج مشوي

# foodWholeWheatRoll
source: Whole Wheat Roll
ar: خبز القمح الكامل

# kcalUnit
source: kcal
ar: سعرة حرارية

# gramUnit
source: g
ar: جم

# cmUnit
source: cm
ar: سم

# kgUnit
source: kg
ar: كجم

# glassesUnit
source: glasses
ar: أكواب

# yearsUnit
source: years
ar: سنة

# catVegetables
source: Vegetables
ar: خضروات

# catFruit
source: Fruit
ar: فواكه

# catMeat
source: Meat and meat products
ar: لحوم ومنتجات اللحوم

# catFish
source: Fish and fish products
ar: أسماك ومنتجات الأسماك

# catCereals
source: Cereals and cereal products
ar: حبوب ومنتجات الحبوب

# catNuts
source: Nuts and seeds
ar: مكسرات وبذور

# catMilk
source: Milk and milk products
ar: حليب ومنتجات الألبان

# catEggs
source: Eggs
ar: بيض

# catBeverages
source: Beverages
ar: مشروبات

# difficultyEasy
source: Easy
ar: سهل

# difficultyMedium
source: Medium
ar: متوسط

# difficultyHard
source: Hard
ar: صعب

# minuteShort
source: min
ar: دقيقة

# servingsLabel
source: servings
ar: حصص

source: Tap to edit
ar: اضغط للتعديل

# stepIndicator
source: Step {step} of {total}
ar: الخطوة {step} من {total}

# stepCurrent
source: , current
ar: ، الحالية

# stepCompleted
source: , completed
ar: ، مكتملة

source: Delete All Data
ar: حذف جميع البيانات

# deleteAllDataTitle
source: Delete All Data
ar: حذف جميع البيانات

# deleteAllDataMessage
source: This will permanently delete all your meals, water intake, weight entries, and profile data. This action cannot be undone.
ar: سيتم حذف جميع وجباتك واستهلاك الماء وإدخالات الوزن وبيانات الملف الشخصي نهائياً. لا يمكن التراجع عن هذا الإجراء.

# deleteAllDataWarning
source: Warning: This is irreversible!
ar: تحذير: لا يمكن التراجع!

# deleteAllDataFinalConfirm
source: Are you sure? All your data will be lost forever.
ar: هل أنت متأكد؟ ستفقد جميع بياناتك للأبد.

# deleteAllDataConfirm
source: Delete Everything
ar: حذف الكل

# dataDeleted
source: All data has been deleted
ar: تم حذف جميع البيانات
